# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

a = [1, 2, 3, 4, 5, 6, 7]
print (a)

res = 1
for i in range(0, len(a)-1):
    if a[i] != a[len(a)- 1 - i]:
        res = a[i] * a[len(a)- 1 - i]
        print(res, end=', ')
    else: 
        print(a[i] * a[len(a)- 1 - i])
        break